app/Services/SocialAuthService.php

select * from `social_providers` where `name` = 'facebook' limit 1
---
    public function createOrGetUser(ProviderUser $providerUser, $socialProvider)
    {
        $provider = SocialProviders::whereName($socialProvider)
        ->first()
        ->id;