app/Http/Controllers/CategoriesController.php

    public function index($category) {
        $category_id = Categories::select('id')
        ->where('name_lat', $category)
        ->first()->id;

        $newsByCategory = News::where('category_id', $category_id)
        ->orderBy('id', 'DESC')
        ->get();

        $categories = Categories::select(
            'id',
            'name_cyr',
            'name_lat',
            'created_at'
        )->get();

        $allNews = News::select(
            'id',
            'author',
            'category_id',
            'resource_id',
            'title',
            'img',
            'text',
            'active',
            'created_at'
        )
        ->orderBy('id', 'DESC')
        ->get();
---
select `id` from `categories` where `name_lat` = 'Politics' limit 1
select * from `news` where `category_id` is null order by `id` desc
select `id`, `name_cyr`, `name_lat`, `created_at` from `categories`
select `id`, `author`, `category_id`, `resource_id`, `title`, `img`, `text`, `active`, `created_at` from `news` order by `id` desc