app/Http/Controllers/DownloadOrderController.php

    public function index()
    {
        $categories = Categories::select(
            'id',
            'name_lat',
            'name_cyr'
        )->get();
---
select `id`, `name_lat`, `name_cyr` from `categories`

    public function store(DownloadOrder $downloadOrder, DownloadOrderPostRequest $request)
    {
        $downloadOrder->fill($request->validated())->save();
---
insert into `download_orders` (`firstname`, `tel`, `email`, `message`, `ip`, `updated_at`, `created_at`) values ('BrowserTest', '89219999999', 'smokdog@me.com', 'BrowserTest BrowserTest BrowserTest BrowserTest BrowserTest', '192.168.99.1', '2020-05-30 08:49:09', '2020-05-30 08:49:09')