app/Http/Controllers/FeedbackController.php

select `id`, `name_lat`, `name_cyr` from `categories`
---
    public function index()
    {
        $categories = Categories::select(
            'id',
            'name_lat',
            'name_cyr'
        )->get();

insert into `feedback` (`firstname`, `message`, `ip`, `updated_at`, `created_at`) values ('BrowserTest', 'BrowserTest BrowserTest BrowserTest BrowserTest BrowserTest', '192.168.99.1', '2020-05-30 06:29:56', '2020-05-30 06:29:56')
---
    public function store(Feedback $feedback, FeedBackPostRequest $request)
    {
        $feedback->fill($request->validated())->save();