app/Http/Controllers/NewsController.php

select `id`, `author`, `category_id`, `resource_id`, `title`, `img`, `text`, `active`, `created_at` from `news`
select `name_lat`, `name_cyr` from `categories`
---
    public function index(){
        $news = News::select(
            'id',
            'author',
            'category_id',
            'resource_id',
            'title',
            'img',
            'text',
            'active',
            'created_at'
        )->get();

        $categories = Categories::select(
            'name_lat',
            'name_cyr'
        )->get();

select `name_lat`, `name_cyr` from `categories`
select `id`, `author`, `category_id`, `resource_id`, `title`, `img`, `text`, `active`, `created_at` from `news` where `news`.`id` is null limit 1
---
    public function show(News $news){
        $categories = Categories::select(
            'name_lat',
            'name_cyr'
        )->get();

        $news = News::select(
            'id',
            'author',
            'category_id',
            'resource_id',
            'title',
            'img',
            'text',
            'active',
            'created_at'
        )->find($news->id);