app/Http/Controllers/Admin/CategoriesController.php

    public function index()
    {
        $categories = Categories::select(
            'id',
            'name_cyr',
            'name_lat',
            'created_at',
        )
        ->orderBy('id', 'DESC')
        ->paginate(10);
---
select `id`, `name_cyr`, `name_lat`, `created_at` from `categories` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `categories`

    public function store(Categories $categories, CategoriesPostRequest $request)
    {
        $categories->fill($request->validated())->save();
---
insert into `categories` (`name_cyr`, `name_lat`, `updated_user_id`, `created_user_id`, `ip`, `updated_at`, `created_at`) values ('Браузер', 'Browser', 4, 4, '192.168.99.1', '2020-05-30 08:47:24', '2020-05-30 08:47:24')

    public function destroy(Categories  $category)
    {
        $result = Categories::find($category->id)->destroy($category->id);
---
delete from `categories` where `id` = 12
select * from `categories` where `id` in (12)