app/Http/Controllers/Admin/DownloadOrderController.php

    public function index()
    {
        $downloadOrder = DownloadOrder::select(
            'id',
            'firstname',
            'tel',
            'email',
            'message',
            'created_at',
        )
        ->orderBy('id', 'DESC')
        ->paginate(10);
---
select `id`, `firstname`, `tel`, `email`, `message`, `created_at` from `download_orders` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `download_orders`

    public function destroy($id)
    {
        $result = DownloadOrder::find($id)->destroy($id);
---
delete from `download_orders` where `id` = 6
select * from `download_orders` where `id` in (6)