app/Http/Controllers/Admin/FeedbackController.php

select `id`, `firstname`, `message`, `created_at` from `feedback` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `feedback`
---
    public function index()
    {
        $feedback = Feedback::select(
            'id',
            'firstname',
            'message',
            'created_at',
        )
        ->orderBy('id', 'DESC')
        ->paginate(10);

update `feedback` set `message` = 'BrowserTest BrowserTest BrowserTest BrowserTest BrowserTest. Addition text test.', `feedback`.`updated_at` = '2020-05-30 08:49:25' where `id` = 95
---
    public function update(Feedback  $feedback, FeedBackPostRequest $request)
    {
        $result = Feedback::find($feedback->id)->update($request->validated());

delete from `feedback` where `id` = 89
select * from `feedback` where `id` in (89)
---
    public function destroy(Feedback $feedback)
    {
        $result = Feedback::find($feedback->id)->destroy($feedback->id);