app/Http/Controllers/Admin/NewsController.php

    public function index()
    {
        $news = News::select(
            'id',
            'author',
            'category_id',
            'resource_id',
            'title',
            'img',
            'text',
            'active',
            'created_at',
        )
        ->orderBy('id', 'DESC')
        ->paginate(5);

        return view('admin.news.index',
            [
                'news' => $news,
                'categories' => Categories::all(),
                'resources' => Resources::all()
            ]
        );
---
select `id`, `author`, `category_id`, `resource_id`, `title`, `img`, `text`, `active`, `created_at` from `news` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `news`
select * from `news`
select * from `resources`
select * from `categories`

    public function create()
    {
        return view('admin.news.create',
            [
                'categories' => Categories::all(),
                'resources' => Resources::all()
            ]
        );
---
select * from `categories`
select * from `resources`

    public function edit(News $news)
    {
        $categories = Categories::select(
            'id',
            'name_lat',
            'name_cyr'
        )->get();

        $resources = Resources::select(
            'id',
            'name',
            'created_at'
        )->get();
---
select `id`, `name_lat`, `name_cyr` from `categories`
select `id`, `name`, `created_at` from `resources`

    public function update(News $news, StoreNewsPost $request)
    {
        $result = News::find($news->id)->update($request->validated());
---
update `news` set `author` = 'BrowserTest. Updated', `category_id` = '8', `resource_id` = '20', `title` = 'BrowserTest. Updated', `text` = 'BrowserTest BrowserTest BrowserTest BrowserTest BrowserTest. Updated', `news`.`updated_at` = '2020-05-30 08:34:02' where `id` = 189

    public function destroy(News $news)
    {
        $result = News::find($news->id)->destroy($news->id);
---
delete from `news` where `id` = 176
select * from `news` where `id` in (176)