app/Http/Controllers/Admin/ParserController.php

select `link` from `sources`
---
    public function index(XMLParserService $xMLParserService)
    {
        $start = date('c');

        $links = Sources::pluck('link')->toArray();