app/Http/Controllers/Admin/ResourcesController.php

select `id`, `name`, `created_at` from `resources` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `resources`
---
    public function index()
    {
        $resources = Resources::select(
            'id',
            'name',
            'created_at'
        )
        ->orderBy('id', 'DESC')
        ->paginate(10);

update `resources` set `name` = 'BrowserTesting. Updated.', `resources`.`updated_at` = '2020-05-30 08:17:19' where `id` = 33
---
    public function update(Resources $resource, ResourcesPostRequest $request)
    {
        $result = Resources::find($resource->id)->update($request->validated());