app/Http/Controllers/Admin/SourcesController.php

select `id`, `name`, `link`, `created_at` from `sources` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `sources`
---
    public function index()
    {
        $sources = Sources::select(
            'id',
            'name',
            'link',
            'created_at',
        )
        ->orderBy('id', 'DESC')
        ->paginate(10);